talks.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-05-30 Sat 01:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Talks</title>
<meta name="author" content="Anand Deopurkar" />
<meta name="description" content="Talks by Anand Deopurkar, a mathematician specialising in algebraic geometry at the Australian National University.  Read about my papers and preprints, including abstracts." />
<meta name="keywords" content="Talks, presentations, Anand Deopurkar, ANU, MSI" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/css/main.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Talks</h1>
<div class="properties" id="org1c7b2e7">

</div>

<p>
Below is a roughly reverse chronological list of my papers and pre-prints, together with abstracts, links to notes or slides, and other commentary.
</p>

<div id="outline-container-org75da810" class="outline-2">
<h2 id="org75da810">Be wise, equivariantise!</h2>
<div class="outline-text-2" id="text-org75da810">
<div class="properties" id="orgcbd5837">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2026</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Sydney, Australia</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="talks/2026-02-sydney.pdf">notes</a></td>
</tr>
</tbody>
</table>

</div>


<div class="abstract" id="orge8ca7c7">
<p>
  In a pencil of plane cubics, how many times do we see a
given \(j\) invariant?  Among the hyperplane slices of a cubic threefold,
how many times does a given cubic surface appear?  These counting
problems, and many others, admit beautiful solutions using equivariant
geometry. I will explain this method and the plethora of other
questions that it opens up.
</p>

</div>

<p>
This talk was based on <a href="papers.html#ID-b1ba9384-4b6a-47b1-888c-61cc0c828493">Equivariant classes of orbits in GL(2)-representations</a> and <a href="papers.html#ID-aa908035-6504-4bd7-8a1d-aecf14f07383">A universal formula for counting cubic surfaces</a>. 
</p>
</div>
</div>

<div id="outline-container-orgfa477ca" class="outline-2">
<h2 id="orgfa477ca">How to count using equivariant cohomology</h2>
<div class="outline-text-2" id="text-orgfa477ca">
<div class="properties" id="org3d56b89">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-right">2026</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-right">Chennai, India</td>
</tr>
</tbody>
</table>

</div>


<div class="abstract" id="orgcdef2da">
<p>
In a pencil of cubic curves, how many times do we see a
given j-invariant?  Among the slices of a plane quintic curve, how
many times do we see a given isomorphism class of 5-points on the
line?  These enumerative questions go under the name of &ldquo;fixed moduli
Gromov&#x2013;Witten theory&rdquo;.  They involve counting objects of a given
moduli (isomorphism class) satisfying certain conditions.  While we
have an array of tools to answer such questions for curves, we know
embarrassingly little for surfaces and beyond. I will explain an
approach to think about fixed moduli Gromov&#x2013;Witten theory using
equivariant geometry.  As an application, I will give a universal
solution to fixed moduli Gromov&#x2013;Witten theory of generic cubic
surfaces.  This is based on joint work with Anand Patel, Dennis Tseng,
and Oliver Li.
</p>

</div>

<p>
This talk was based on <a href="papers.html#ID-b1ba9384-4b6a-47b1-888c-61cc0c828493">Equivariant classes of orbits in GL(2)-representations</a> and <a href="papers.html#ID-aa908035-6504-4bd7-8a1d-aecf14f07383">A universal formula for counting cubic surfaces</a>. 
</p>
</div>
</div>


<div id="outline-container-orga6414a9" class="outline-2">
<h2 id="orga6414a9">A Thurston compactification of the space of stability conditions</h2>
<div class="outline-text-2" id="text-orga6414a9">
<div class="properties" id="orge95d8f1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2025</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Creswick, Australia</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="talks/2025-Creswick.html#ID-9ad7fb07-194d-485d-bfbb-6eef16e1add4">notes</a></td>
</tr>
</tbody>
</table>

</div>


<div class="abstract" id="org8314e14">
<p>
There is a close connection between metric geometry of a
surface and homological algebra, which suggests that techniques from
one domain should have counterparts in the other domain. Exploring
this theme, we compactify the space of Bridgeland stability conditions
using a construction similar to Thurston&rsquo;s compactification of the
Teichmuller space.  I will describe this compactification and its
boundary in a few examples with the hope to generate speculation about
the general case.  Based on joint work with Asilata Bapat and Tony
Licata.
</p>

</div>

<p>
This talk was based on <a href="papers.html#ID-7ee039fe-461d-41bb-8a73-116bc7f196e0">A Thurston compactification of the space of stability conditions</a>.
</p>
</div>
</div>

<div id="outline-container-org2554fc9" class="outline-2">
<h2 id="org2554fc9">The enumerative geometry of orbit closures</h2>
<div class="outline-text-2" id="text-org2554fc9">
<div class="properties" id="org56bd4c7">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-right">2025</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-right">Melbourne, Australia</td>
</tr>
</tbody>
</table>

</div>

<div class="abstract" id="org0879a11">
<p>
Take a degree d form in n variables.  What can we say about
its GL(n) orbit?  In particular, what is its degree?  For n = 1 and 2,
the answers were known by the year 1900.  For n = 3, Carel Faber and
Paolo Aluffi found the answers around the year 2000.  I will discuss
recent progress in higher dimensions on this and related questions,
and the intricate geometry that seems to govern the answers.  Based on
joint work with Anand Patel and Dennis Tseng.
</p>

</div>

<p>
This talk was based on <a href="papers.html#ID-b1ba9384-4b6a-47b1-888c-61cc0c828493">Equivariant classes of orbits in GL(2)-representations</a> and <a href="papers.html#ID-aa908035-6504-4bd7-8a1d-aecf14f07383">A universal formula for counting cubic surfaces</a>. 
</p>
</div>
</div>


<div id="outline-container-org43c9d3b" class="outline-2">
<h2 id="org43c9d3b">How twisty is that orbit?</h2>
<div class="outline-text-2" id="text-org43c9d3b">
<div class="properties" id="org705e4d1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2024</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Auckland, New Zealand</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="talks/2024-12-AustMS.pdf">slides</a></td>
</tr>
</tbody>
</table>

</div>

<div class="abstract" id="org6ef26c3">
<p>
Fix a polynomial \(P\). How complicated is the set of all polynomials obtained from \(P\) by changes of coordinates? This question, and many others, generalise as follows: given a representation an algebraic group, how complicated is the orbit of a given element? I will describe some answers, featuring toric varieties, Newton polyhedra, and stacks. 
</p>

</div>

<p>
This talk was based on <a href="papers.html#ID-b1ba9384-4b6a-47b1-888c-61cc0c828493">Equivariant classes of orbits in GL(2)-representations</a> and <a href="papers.html#ID-aa908035-6504-4bd7-8a1d-aecf14f07383">A universal formula for counting cubic surfaces</a>. 
</p>
</div>
</div>
