content/talks.org
* The work of Maryam Mirzakhani                              :talk:highlight:
:properties:
:venue:  Australian National University
:where:    Canberra, Australia
:when:     2024
:comments:     expository, 
:ID:       53fe8ada-0bc4-439b-9763-84cbb137727b
:links:    [[id:e5dcac8c-b6ff-4e38-919b-c90d821d4187][notes]]
:labels:   [[id:05f9493f-833e-4f64-a2b5-321a11c91a3b][expository]]
:end:

This was an expository talk explaining the work of Maryam Mirzakhani on the occasion of /Women in Maths Day/.  I explained her work on the asymptotics of the number of geodesics on a hyperbolic surface to a general mathematical audience.

* Papercraft                                                           :talk:
:properties:
:venue:     ANU Mathematics Extension Program
:where:    Canberra, Australia
:when:     2024
:comments:     expository
:ID:       cabeb946-def4-40fa-952d-e84395084692
:links: [[file:talks/2024-09-25-zoom-board.pdf][online board]]
:labels:   [[id:05f9493f-833e-4f64-a2b5-321a11c91a3b][expository]]
:end:

This talk was based on Paul Seidel's [[https://www.ams.org/open-math-notes/files/course-material/OMN-202102-111288-1-Course_notes-v2.pdf][Lectures on geometry and topology in the plane]], Lecture 1 on cutting/regluing polygons.  The talk was on zoom.

#+begin_abstract
My origami directions call for a square, but I have an
A4-sized rectangle.  But I also have scissors!  Can I cut the
rectangle and reglue the pieces to get a square?  More generally, when
can I cut a shape A and reglue it to make another shape B?  Come to
the talk and find the answer.  Scissors, tape, and paper optional, but
recommended!
#+end_abstract

* The geometry of stability conditions                                 :talk:
:properties:
:venue:  Artin groups meet triangulated categories, Mathematisches Forschungsinstitut Oberwolfach
:where:    Oberwolfach, Germany
:when:     2024
:type:     workshop
:ID:       7658a59d-72ee-45ee-a5ca-c002fa285e32
:links:    [[file:talks/2024-Oberwolfach.pdf][extended abstract]]
:end:

This was a talk based on [[id:7ee039fe-461d-41bb-8a73-116bc7f196e0][A Thurston compactification of the space of stability conditions]] and [[id:8c1b044d-82a9-4cbc-986e-a07f93dc93d1][Spherical objects and stability conditions on 2-Calabi--Yau quiver categories]].

* How to count using equivariant cohomology                            :talk:
:properties:
:type:     workshop
:venue:  Workshop on computational and applied algebraic geometry, Isaac Newton Institute
:where:    Cambridge, UK
:when:     2024
:ID:       be005987-7704-463e-a9eb-9f4b21b088f5
:end:

This was a talk based on [[id:aa908035-6504-4bd7-8a1d-aecf14f07383][A universal formula for counting cubic surfaces]].  

* How to count using equivariant cohomology                            :talk:
:properties:
:type:     seminar
:venue: Imperial College
:where:    London, UK
:when:     2024
:ID:       aade0389-a29c-48e8-a3c1-ca32b9f6e864
:end:

This was a talk based on [[id:aa908035-6504-4bd7-8a1d-aecf14f07383][A universal formula for counting cubic surfaces]].

* Stability conditions, metrics, and compactifications                 :talk:
:properties:
:venue: School of Mathematics
:where:    Edinburgh, UK
:when:     2024
:type:     seminar
:ID:       a96b3cc1-a39c-46fd-b4f5-a1d225a3a732
:links:    [[id:0575067f-9400-4257-9677-d78bec82f59e][notes]]
:end:

This was a talk based on [[id:7ee039fe-461d-41bb-8a73-116bc7f196e0][A Thurston compactification of the space of stability conditions]]. 

* Stability conditions, metrics, and compactifications (lecture series) :talk:
:properties:
:venue:  Summer school 2023 on algebraic geometry: derived categories, stability conditions, and moduli, Technion
:where:    Haifa, Israel
:when:     2023
:type:     series
:ID:       0be3113e-3a2b-46c2-a4a8-281747fa26bc
:links:   [[id:75106f4c-f358-4630-b982-2cbaec4cda10][notes]]
:end:

This mini course consisted of 3 lectures of 1.5 hours each.  This was based on [[id:7ee039fe-461d-41bb-8a73-116bc7f196e0][A Thurston compactification of the space of stability conditions]] and ideas surrounding it.

* Braids, automata, and the PL-sphere                                  :talk:
:properties:
:type:    workshop
:venue:  Braids: algebra and geometry, Australian National University
:where:    Canberra, Australia
:when:     2023
:ID:       b5064898-9699-4e07-ad07-729aa9c12d53
:links:    [[file:talks/2023-05-05-ANU.pdf][notes]]
:end:

This talk is based on the ideas [[id:1245acba-aa78-4ab6-ad92-fb1c2c46b5c6][A sphere of spherical objects]].  You see that it took us a couple of years to finish writing the paper!

* Carpentry, geometry, and category theory                             :talk:
:properties:
:type:    colloquium
:venue: Chennai Mathematical Institute
:where:    Chennai, India
:when:     2022
:ID:       690f32f2-8492-49ae-87a7-11d9d6465e13
:links:    [[id:141efcde-1e52-47f5-b7e2-cea28ee0dcd0][notes]]
:end:
This talk was based on an idea to contract stability manifolds for certain categories using techniques from rigidity theory.  We have still not finished writing up all the details.   


*  Error correcting codes                                              :talk:
:properties:
:venue:     ANU Mathematics Extension Program
:where:    Canberra, Australia
:when:     2022
:comments:     expository
:ID:       73b5521a-6738-40bd-b4d0-481f79f50bce
:links: [[id:648707cc-d8ae-4d0a-8cf7-53fef49db34b][slides]]
:labels:   [[id:05f9493f-833e-4f64-a2b5-321a11c91a3b][expository]]
:end:

* How to count using equivariant cohomology                            :talk:
:properties:
:type:     seminar
:venue: Australian National University
:where:    Canberra, Australia
:when:     2022
:ID:       0ea1d0f0-8ce8-40b2-98f0-6d811620ddd6
:end:

This was  based on [[id:aa908035-6504-4bd7-8a1d-aecf14f07383][A universal formula for counting cubic surfaces]].


