talks.html

<div id="outline-container-orge058483" class="outline-2">
<h2 id="orge058483">The work of Maryam Mirzakhani</h2>
<div class="outline-text-2" id="text-orge058483">
<div class="properties" id="org43016ed">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2024</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Canberra, Australia</td>
</tr>

<tr>
<td class="org-left"><b>comments</b></td>
<td class="org-left">expository,</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="talks/2024-05-13-the-work-of-maryam-mirzakhani.html#ID-e5dcac8c-b6ff-4e38-919b-c90d821d4187">notes</a></td>
</tr>

<tr>
<td class="org-left"><b>labels</b></td>
<td class="org-left"><a href="expository.html#ID-05f9493f-833e-4f64-a2b5-321a11c91a3b">expository</a></td>
</tr>
</tbody>
</table>

</div>


<p>
This was an expository talk explaining the work of Maryam Mirzakhani on the occasion of <i>Women in Maths Day</i>.  I explained her work on the asymptotics of the number of geodesics on a hyperbolic surface to a general mathematical audience.
</p>
</div>

<ul class="org-ul">
<li><a id="orge08dd4d"></a>What links here?<br />
<div class="outline-text-3" id="text-orge08dd4d">
<ul class="org-ul">
<li><a href="expository.html#ID-05f9493f-833e-4f64-a2b5-321a11c91a3b">Expository writing and talks</a></li>
<li><a href="index.html#ID-d990bcc9-227c-4e82-9e93-512139e14f45">Home</a></li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgff4690f" class="outline-2">
<h2 id="orgff4690f">Papercraft</h2>
<div class="outline-text-2" id="text-orgff4690f">
<div class="properties" id="org85137f5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2024</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Canberra, Australia</td>
</tr>

<tr>
<td class="org-left"><b>comments</b></td>
<td class="org-left">expository</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="talks/2024-09-25-zoom-board.pdf">online board</a></td>
</tr>

<tr>
<td class="org-left"><b>labels</b></td>
<td class="org-left"><a href="expository.html#ID-05f9493f-833e-4f64-a2b5-321a11c91a3b">expository</a></td>
</tr>
</tbody>
</table>

</div>


<p>
This talk was based on Paul Seidel&rsquo;s <a href="https://www.ams.org/open-math-notes/files/course-material/OMN-202102-111288-1-Course_notes-v2.pdf">Lectures on geometry and topology in the plane</a>, Lecture 1 on cutting/regluing polygons.  The talk was on zoom.
</p>

<div class="abstract" id="org6781e6c">
<p>
My origami directions call for a square, but I have an
A4-sized rectangle.  But I also have scissors!  Can I cut the
rectangle and reglue the pieces to get a square?  More generally, when
can I cut a shape A and reglue it to make another shape B?  Come to
the talk and find the answer.  Scissors, tape, and paper optional, but
recommended!
</p>

</div>
</div>

<ul class="org-ul">
<li><a id="org7cd21bb"></a>What links here?<br />
<div class="outline-text-3" id="text-org7cd21bb">
<ul class="org-ul">
<li><a href="expository.html#ID-05f9493f-833e-4f64-a2b5-321a11c91a3b">Expository writing and talks</a></li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgfef7535" class="outline-2">
<h2 id="orgfef7535">The geometry of stability conditions</h2>
<div class="outline-text-2" id="text-orgfef7535">
<div class="properties" id="org6870fd7">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2024</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Oberwolfach, Germany</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="talks/2024-Oberwolfach.pdf">extended abstract</a></td>
</tr>
</tbody>
</table>

</div>


<p>
This was a talk based on <a href="papers.html#ID-7ee039fe-461d-41bb-8a73-116bc7f196e0">A Thurston compactification of the space of stability conditions</a> and <a href="papers.html#ID-8c1b044d-82a9-4cbc-986e-a07f93dc93d1">Spherical objects and stability conditions on 2-Calabi&#x2013;Yau quiver categories</a>.
</p>
</div>
</div>

<div id="outline-container-orgc9cc5bd" class="outline-2">
<h2 id="orgc9cc5bd">How to count using equivariant cohomology</h2>
<div class="outline-text-2" id="text-orgc9cc5bd">
<div class="properties" id="org9ffbdc2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-right">2024</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-right">Cambridge, UK</td>
</tr>
</tbody>
</table>

</div>


<p>
This was a talk based on <a href="papers.html#ID-aa908035-6504-4bd7-8a1d-aecf14f07383">A universal formula for counting cubic surfaces</a>.  
</p>
</div>
</div>

<div id="outline-container-orgaa95c90" class="outline-2">
<h2 id="orgaa95c90">How to count using equivariant cohomology</h2>
<div class="outline-text-2" id="text-orgaa95c90">
<div class="properties" id="org02e2bfc">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-right">2024</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-right">London, UK</td>
</tr>
</tbody>
</table>

</div>


<p>
This was a talk based on <a href="papers.html#ID-aa908035-6504-4bd7-8a1d-aecf14f07383">A universal formula for counting cubic surfaces</a>.
</p>
</div>
</div>

<div id="outline-container-orga995912" class="outline-2">
<h2 id="orga995912">Stability conditions, metrics, and compactifications</h2>
<div class="outline-text-2" id="text-orga995912">
<div class="properties" id="orgde6b40c">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2024</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Edinburgh, UK</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="talks/2024-Edinburgh.html#ID-0575067f-9400-4257-9677-d78bec82f59e">notes</a></td>
</tr>
</tbody>
</table>

</div>


<p>
This was a talk based on <a href="papers.html#ID-7ee039fe-461d-41bb-8a73-116bc7f196e0">A Thurston compactification of the space of stability conditions</a>. 
</p>
</div>
</div>

<div id="outline-container-org7206aee" class="outline-2">
<h2 id="org7206aee">Stability conditions, metrics, and compactifications (lecture series)</h2>
<div class="outline-text-2" id="text-org7206aee">
<div class="properties" id="orgea4008e">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2023</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Haifa, Israel</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="talks/2023-Haifa.html#ID-75106f4c-f358-4630-b982-2cbaec4cda10">notes</a></td>
</tr>
</tbody>
</table>

</div>


<p>
This mini course consisted of 3 lectures of 1.5 hours each.  This was based on <a href="papers.html#ID-7ee039fe-461d-41bb-8a73-116bc7f196e0">A Thurston compactification of the space of stability conditions</a> and ideas surrounding it.
</p>
</div>
</div>

<div id="outline-container-org1f8928c" class="outline-2">
<h2 id="org1f8928c">Braids, automata, and the PL-sphere</h2>
<div class="outline-text-2" id="text-org1f8928c">
<div class="properties" id="org10b7ba5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2023</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Canberra, Australia</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="talks/2023-05-05-ANU.pdf">notes</a></td>
</tr>
</tbody>
</table>

</div>


<p>
This talk is based on the ideas <a href="papers.html#ID-1245acba-aa78-4ab6-ad92-fb1c2c46b5c6">A sphere of spherical objects</a>.  You see that it took us a couple of years to finish writing the paper!
</p>
</div>
</div>

<div id="outline-container-org57af061" class="outline-2">
<h2 id="org57af061">Carpentry, geometry, and category theory</h2>
<div class="outline-text-2" id="text-org57af061">
<div class="properties" id="orgdcd625f">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2022</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Chennai, India</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="talks/2022-Chennai.html#ID-141efcde-1e52-47f5-b7e2-cea28ee0dcd0">notes</a></td>
</tr>
</tbody>
</table>

</div>

<p>
This talk was based on an idea to contract stability manifolds for certain categories using techniques from rigidity theory.  We have still not finished writing up all the details.   
</p>
</div>
</div>
