content/talks.org
*  Combinatorics and dynamics of Harder-Narasimhan filtrations         :talk:
:properties:
:venue: Tsinghua University (Online)
:where:    Beijing, China
:when:     2022
:type:     seminar 
:ID:       e3ca51e8-dc0a-494f-8778-af99cb3557d4
:links:    [[file:talks/2022-Tsinghua.pdf][slides]]
:end:

This was based on [[id:1245acba-aa78-4ab6-ad92-fb1c2c46b5c6][A sphere of spherical objects]].


*  Braids and monodromy in algebraic geometry                          :talk:
:properties:
:venue:      Braids in Symplectic and Algebraic Geometry, ICERM, Brown University
:where:    Providence, Rhode Island
:when:     2022
:comments:     expository
:ID:       d56cfe9b-e442-45de-b323-12ec02a5858c
:labels:   [[id:05f9493f-833e-4f64-a2b5-321a11c91a3b][expository]]
:end:
This was an expository pre-talk for the workshop /Braids in symplectic and algebraic Geometry/ at ICERM.


* How to count using equivariant cohomology                            :talk:
:properties:
:type:     seminar
:venue: Harvard University
:where:    Cambridge, Massachusetts
:when:     2022
:links: [[file:talks/2022-Harvard.pdf][notes]]
:ID:       33b0c188-4659-48cd-b0c6-bdb652c4a1c8
:end:

This was  based on [[id:aa908035-6504-4bd7-8a1d-aecf14f07383][A universal formula for counting cubic surfaces]].

* Apparent boundaries of projective varieties                          :talk:
:PROPERTIES:
:type:     seminar
:venue: Brown University
:where:    Providence, Rhode Island
:when:     2022
:ID:       d15d311e-f06f-458d-b7f5-90c27c6d5451
:END:

This was based on [[id:82e9302f-6674-41b8-97cd-6733ac7edf89][Ramification divisors of general projections]].

* The geometry and combinatorics of Harder--Narasimhan filtrations     :talk:
:properties:
:venue:      Braids in representation theory and algebraic combinatorics, Institute for Computational and Experimental Research in Mathematics
:where:    Providence, Rhode Island
:when:     2022
:links:      [[file:talks/2022-ICERM.pdf][notes]]
:type:     conference
:ID:       79f50459-44a2-48d5-b78d-b1a35ef9a728
:end:

This was based on the future paper [[id:1245acba-aa78-4ab6-ad92-fb1c2c46b5c6][A sphere of spherical objects]].

* The geometry of Fermat-like equations                                :talk:
:properties:
:venue:      Trimester program on triangle groups, Belyi uniformization, and modularity, Bhaskaracharya Pratishthana
:where:    Pune, India
:when:     2022
:comments:     expository
:links:      [[file:talks/2022-Fermat.pdf][notes]]
:comments: expository
:ID:       aa9aba31-dd50-4cda-9859-d3623b6f163f
:labels:   [[id:05f9493f-833e-4f64-a2b5-321a11c91a3b][expository]]
:end:

This is the second talk I gave this trimester program.  I explained the argument by Darmon and Granville that "hyperbolic" Fermat-like equations(\(A x^l + B y^m = C z^n\) where \(1/l + 1/m + 1/p < 1\)) have only finitely many integral solutions.  The theorem and the proof is an orbifold version of Faltings's theorem that hyperbolic curves have only finitely many rational points.  

Also see the [[id:9efcc78f-db58-4c06-a73a-405566487ca4][expository article]] I wrote accompanying the talks. 

* Algebraic curves and Belyi's theorem                                 :talk:
:properties:
:venue:      Trimester program on triangle groups, Belyi uniformization, and modularity, Bhaskaracharya Pratishthana
:where:    Pune, India
:when:     2021
:comments:     expository
:links:      [[file:talks/2021-Belyi.pdf][notes]]
:ID:       e19269e4-2c30-4e4d-8671-3e7f0b7cb3e8
:labels:   [[id:05f9493f-833e-4f64-a2b5-321a11c91a3b][expository]]
:end:

This is the first talk I gave in this trimester program.  I explain the statement and proof of Belyi's famous theorem.

Also see the [[id:9efcc78f-db58-4c06-a73a-405566487ca4][expository article]] I wrote accompanying the talks.

* Error correcting codes                                               :talk:
:properties:
:venue:     ANU Mathematics Extension Program
:where:    Canberra, Australia
:when:     2021
:comments:     expository
:links:      [[id:648707cc-d8ae-4d0a-8cf7-53fef49db34b][slides]]
:ID:       0ae10d06-c9f2-4972-a24e-f4e71f093f5f
:labels:   [[id:05f9493f-833e-4f64-a2b5-321a11c91a3b][expository]]
:end:

* A Thurston compactification of the space of stability conditions     :talk:
:properties:
:venue:      Workshop on compactifications of stability manifolds (Online), Max Planck institute für Mathematics
:where:    Bonn, Germany
:when:     2021
:type:     workshop
:links:      [[file:talks/2021-Bonn.pdf][notes]]
:ID:       2f305ce3-232e-4ccc-aee8-aecaed79621c
:end:

This talk was based on
[[id:7ee039fe-461d-41bb-8a73-116bc7f196e0][A Thurston compactification of the space of stability conditions]].

* A Thurston compactification of the space of stability conditions     :talk:
:properties:
:venue: Tata Institute of Fundamental Research (Online)
:where:    Mumbai, India
:when:     2021
:type:     seminar
:links:      [[file:talks/2021-tifr.pdf][notes]]
:ID:       4bd1a492-852f-4962-ad17-ba41aacea050
:end:

This talk was based on
[[id:7ee039fe-461d-41bb-8a73-116bc7f196e0][A Thurston compactification of the space of stability conditions]].


*  A Thurston compactification of the space of stability conditions    :talk:
:properties:
:venue: Jagiellonian University (Online)
:where:    Kraków, Poland
:when:     2021
:type:     seminar
:ID:       356b4691-55ae-462b-ad51-37e32bbe6462
:end:

This talk was based on
[[id:7ee039fe-461d-41bb-8a73-116bc7f196e0][A Thurston compactification of the space of stability conditions]].


