talks.html


<div id="outline-container-orgf08d48e" class="outline-2">
<h2 id="orgf08d48e">Error correcting codes</h2>
<div class="outline-text-2" id="text-orgf08d48e">
<div class="properties" id="org03d5586">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2022</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Canberra, Australia</td>
</tr>

<tr>
<td class="org-left"><b>comments</b></td>
<td class="org-left">expository</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="talks/ecc2021/ecc.html#ID-648707cc-d8ae-4d0a-8cf7-53fef49db34b">slides</a></td>
</tr>

<tr>
<td class="org-left"><b>labels</b></td>
<td class="org-left"><a href="expository.html#ID-05f9493f-833e-4f64-a2b5-321a11c91a3b">expository</a></td>
</tr>
</tbody>
</table>

</div>
</div>


<ul class="org-ul">
<li><a id="org86d9b79"></a>What links here?<br />
<div class="outline-text-3" id="text-org86d9b79">
<ul class="org-ul">
<li><a href="expository.html#ID-05f9493f-833e-4f64-a2b5-321a11c91a3b">Expository writing and talks</a></li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org699ea93" class="outline-2">
<h2 id="org699ea93">How to count using equivariant cohomology</h2>
<div class="outline-text-2" id="text-org699ea93">
<div class="properties" id="org3ef74d4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-right">2022</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-right">Canberra, Australia</td>
</tr>
</tbody>
</table>

</div>


<p>
This was  based on <a href="papers.html#ID-aa908035-6504-4bd7-8a1d-aecf14f07383">A universal formula for counting cubic surfaces</a>.
</p>
</div>
</div>


<div id="outline-container-org65711e2" class="outline-2">
<h2 id="org65711e2">Combinatorics and dynamics of Harder-Narasimhan filtrations</h2>
<div class="outline-text-2" id="text-org65711e2">
<div class="properties" id="orgd157abd">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2022</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Beijing, China</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="talks/2022-Tsinghua.pdf">slides</a></td>
</tr>
</tbody>
</table>

</div>


<p>
This was based on <a href="papers.html#ID-1245acba-aa78-4ab6-ad92-fb1c2c46b5c6">A sphere of spherical objects</a>.
</p>
</div>
</div>


<div id="outline-container-orgbe2d81f" class="outline-2">
<h2 id="orgbe2d81f">Braids and monodromy in algebraic geometry</h2>
<div class="outline-text-2" id="text-orgbe2d81f">
<div class="properties" id="org1efc1bd">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2022</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Providence, Rhode Island</td>
</tr>

<tr>
<td class="org-left"><b>comments</b></td>
<td class="org-left">expository</td>
</tr>

<tr>
<td class="org-left"><b>labels</b></td>
<td class="org-left"><a href="expository.html#ID-05f9493f-833e-4f64-a2b5-321a11c91a3b">expository</a></td>
</tr>
</tbody>
</table>

</div>

<p>
This was an expository pre-talk for the workshop <i>Braids in symplectic and algebraic Geometry</i> at ICERM.
</p>
</div>


<ul class="org-ul">
<li><a id="orgdd422fc"></a>What links here?<br />
<div class="outline-text-3" id="text-orgdd422fc">
<ul class="org-ul">
<li><a href="expository.html#ID-05f9493f-833e-4f64-a2b5-321a11c91a3b">Expository writing and talks</a></li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-orga2a5691" class="outline-2">
<h2 id="orga2a5691">How to count using equivariant cohomology</h2>
<div class="outline-text-2" id="text-orga2a5691">
<div class="properties" id="org078062c">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2022</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Cambridge, Massachusetts</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="talks/2022-Harvard.pdf">notes</a></td>
</tr>
</tbody>
</table>

</div>


<p>
This was  based on <a href="papers.html#ID-aa908035-6504-4bd7-8a1d-aecf14f07383">A universal formula for counting cubic surfaces</a>.
</p>
</div>
</div>

<div id="outline-container-orgab7c684" class="outline-2">
<h2 id="orgab7c684">Apparent boundaries of projective varieties</h2>
<div class="outline-text-2" id="text-orgab7c684">
<div class="properties" id="orgf731a56">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-right">2022</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-right">Providence, Rhode Island</td>
</tr>
</tbody>
</table>

</div>


<p>
This was based on <a href="papers.html#ID-82e9302f-6674-41b8-97cd-6733ac7edf89">Ramification divisors of general projections</a>.
</p>
</div>
</div>

<div id="outline-container-orgb7a0567" class="outline-2">
<h2 id="orgb7a0567">The geometry and combinatorics of Harder&#x2013;Narasimhan filtrations</h2>
<div class="outline-text-2" id="text-orgb7a0567">
<div class="properties" id="org705b3dd">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2022</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Providence, Rhode Island</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="talks/2022-ICERM.pdf">notes</a></td>
</tr>
</tbody>
</table>

</div>


<p>
This was based on the future paper <a href="papers.html#ID-1245acba-aa78-4ab6-ad92-fb1c2c46b5c6">A sphere of spherical objects</a>.
</p>
</div>
</div>

<div id="outline-container-orgbf7cf39" class="outline-2">
<h2 id="orgbf7cf39">The geometry of Fermat-like equations</h2>
<div class="outline-text-2" id="text-orgbf7cf39">
<div class="properties" id="org77fc893">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2022</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Pune, India</td>
</tr>

<tr>
<td class="org-left"><b>comments</b></td>
<td class="org-left">expository</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="talks/2022-Fermat.pdf">notes</a></td>
</tr>

<tr>
<td class="org-left"><b>labels</b></td>
<td class="org-left"><a href="expository.html#ID-05f9493f-833e-4f64-a2b5-321a11c91a3b">expository</a></td>
</tr>
</tbody>
</table>

</div>


<p>
This is the second talk I gave this trimester program.  I explained the argument by Darmon and Granville that &ldquo;hyperbolic&rdquo; Fermat-like equations(\(A x^l + B y^m = C z^n\) where \(1/l + 1/m + 1/p < 1\)) have only finitely many integral solutions.  The theorem and the proof is an orbifold version of Faltings&rsquo;s theorem that hyperbolic curves have only finitely many rational points.  
</p>

<p>
Also see the <a href="papers.html#ID-9efcc78f-db58-4c06-a73a-405566487ca4">expository article</a> I wrote accompanying the talks. 
</p>
</div>

<ul class="org-ul">
<li><a id="org56e891f"></a>What links here?<br />
<div class="outline-text-3" id="text-org56e891f">
<ul class="org-ul">
<li><a href="expository.html#ID-05f9493f-833e-4f64-a2b5-321a11c91a3b">Expository writing and talks</a></li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org0b5dcdf" class="outline-2">
<h2 id="org0b5dcdf">Algebraic curves and Belyi&rsquo;s theorem</h2>
<div class="outline-text-2" id="text-org0b5dcdf">
<div class="properties" id="org19a0300">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2021</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Pune, India</td>
</tr>

<tr>
<td class="org-left"><b>comments</b></td>
<td class="org-left">expository</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="talks/2021-Belyi.pdf">notes</a></td>
</tr>

<tr>
<td class="org-left"><b>labels</b></td>
<td class="org-left"><a href="expository.html#ID-05f9493f-833e-4f64-a2b5-321a11c91a3b">expository</a></td>
</tr>
</tbody>
</table>

</div>


<p>
This is the first talk I gave in this trimester program.  I explain the statement and proof of Belyi&rsquo;s famous theorem.
</p>

<p>
Also see the <a href="papers.html#ID-9efcc78f-db58-4c06-a73a-405566487ca4">expository article</a> I wrote accompanying the talks.
</p>
</div>

<ul class="org-ul">
