content/talks.org
* The work of Caucher Birkar                      :expository:talk:highlight:
:properties:
:venue:     Australian National University
:where:    Canberra, Australia
:when:     2018
:comments:  expository
:links:      [[file:talks/2018-FMColloquium.pdf][notes]]
:ID:       c66380b2-8eca-4313-8360-16b28533e3fe
:labels:   [[id:05f9493f-833e-4f64-a2b5-321a11c91a3b][expository]]
:end:
This was an expository talk in the Fields Medal Colloquium in our department.  We explained the work of a fields medallist to a general mathematical audience.   

*  Moduli of almost K3 log surfaces and curves of genus 4              :talk:
:properties:
:venue:      Algebraic surfaces and related topics, Xiamen University
:where:    Xiamen, China
:when:     2018
:type:     conference
:ID:       abc95646-fb16-479e-a862-11ec50c53266
:end:

This talk was based on
[[id:f7400180-00b7-4b54-a902-8941b3bd3823][Stable log surfaces, admissible covers, and canonical curves of genus 4]]. 

* How to count using (co)homology                            :talk:highlight:
:properties:
:venue: Tata Institute of Fundamental Research
:where:    Mumbai, India
:when:     2018
:comments:     expository
:links:      [[file:talks/2018-tifr.pdf][notes]]
:ID:       5b14bbaa-5b4d-4170-81d8-46ffc0b65716
:labels:   [[id:05f9493f-833e-4f64-a2b5-321a11c91a3b][expository]]
:end:
This was an expository talk for undergraduate students.  Through examples, I explained how to use the cup product in cohomology (more precisely, its dual, the intersection product on homology) to solve some counting problems.  This was inspired by a similar talk by Rahul Pandharipande that I heard when I was an undergraduate. 

*  What are ribbons and what do they tell us about Riemann surfaces    :talk:
:properties:
:venue: Indian Institute of Science
:where:    Bengaluru, India
:when:     2018
:type:     seminar
:ID:       2af99e2d-fe7a-4ade-bddd-9652dcf01134
:end:

This talk was based on
[[id:c399a596-99cb-41bc-945b-a2846c40757e][The canonical syzygy conjecture for ribbons]].

* What are ribbons and what do they tell us about Riemann surfaces     :talk:
:properties:
:venue: Monash University
:where:    Melbourne, Australia
:when:     2018
:type:     seminar
:links:      [[file:talks/2018-Monash.pdf][notes]]
:ID:       1e04c7ae-c3c7-41d5-a0c6-063cecd571a4
:end:

This talk was based on
[[id:c399a596-99cb-41bc-945b-a2846c40757e][The canonical syzygy conjecture for ribbons]].


*  On the critical loci of finite maps                                 :talk:
:properties:
:venue: Australian National University
:where:    Canberra, Australia
:when:     2018
:type:     seminar
:ID:       bbb8a481-da36-4734-bdc4-b887c9bef678
:end:

This talk was based on
[[id:82e9302f-6674-41b8-97cd-6733ac7edf89][Ramification divisors of general projections]].

* Quadrature and algebraic geometry                                    :talk:
:properties:
:venue:      Workshop on algebraic geometry approximation, and optimization, MATRIX
:where:    Creswick, Victoria, Australia
:when:     2018
:links:      [[file:talks/2018-MATRIX.pdf][notes]]
:type:     workshop
:ID:       8e426746-ffde-4cce-8a49-6efbfc51657b
:end:

*  Vector bundles and finite covers                                    :talk:
:properties:
:venue:      Workshop on topics in algebraic geometry, University of North Carolina
:where:    Chapel Hill, North Carolina
:when:     2017
:type:     workshop
:ID:       95e026b4-cf2d-479e-a737-e6acc88a8336
:end:

This talk was based on
[[id:4b773769-0ca6-42a8-a8e6-309dd23ffa5c][Vector bundles and finite covers]].

*  Vector bundles and finite covers                                    :talk:
:properties:
:venue: University of Georgia
:where:    Athens, Georgia
:when:     2017
:type:     seminar
:ID:       03d2c273-17d0-4e3a-9659-df8f8e2160eb
:end:

This talk was based on
[[id:4b773769-0ca6-42a8-a8e6-309dd23ffa5c][Vector bundles and finite covers]].


*  How to count using topology                                         :talk:
:properties:
:venue: Canada/USA Mathcamp
:where:    Tacoma, WA
:when:     2017
:comments:     expository
:ID:       6cfb0fb2-2619-4a02-95d1-5728f3c28bfe
:labels:   [[id:05f9493f-833e-4f64-a2b5-321a11c91a3b][expository]]
:end:

*  Quivers and their representations                                   :talk:
:properties:
:venue: Indian Institute of Science Education and Research
:where:    Pune, India
:when:     2017
:type:     seminar
:ID:       3960c35a-23e8-49a5-82e4-a66221446284
:end:

*  Vector bundles and finite covers                                    :talk:
:properties:
:venue: Emory University
:where:    Atlanta, Georgia
:when:     2017
:type:     seminar
:ID:       8ef3c3f6-5328-4a13-83bb-c72055df3e20
:end:

This talk was based on
[[id:4b773769-0ca6-42a8-a8e6-309dd23ffa5c][Vector bundles and finite covers]].


