talks.html

<div id="outline-container-org949bc60" class="outline-2">
<h2 id="org949bc60">The work of Caucher Birkar</h2>
<div class="outline-text-2" id="text-org949bc60">
<div class="properties" id="orgeac42d0">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2018</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Canberra, Australia</td>
</tr>

<tr>
<td class="org-left"><b>comments</b></td>
<td class="org-left">expository</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="talks/2018-FMColloquium.pdf">notes</a></td>
</tr>

<tr>
<td class="org-left"><b>labels</b></td>
<td class="org-left"><a href="expository.html#ID-05f9493f-833e-4f64-a2b5-321a11c91a3b">expository</a></td>
</tr>
</tbody>
</table>

</div>

<p>
This was an expository talk in the Fields Medal Colloquium in our department.  We explained the work of a fields medallist to a general mathematical audience.   
</p>
</div>

<ul class="org-ul">
<li><a id="orgba3884b"></a>What links here?<br />
<div class="outline-text-3" id="text-orgba3884b">
<ul class="org-ul">
<li><a href="expository.html#ID-05f9493f-833e-4f64-a2b5-321a11c91a3b">Expository writing and talks</a></li>
<li><a href="index.html#ID-d990bcc9-227c-4e82-9e93-512139e14f45">Home</a></li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org05aa392" class="outline-2">
<h2 id="org05aa392">Moduli of almost K3 log surfaces and curves of genus 4</h2>
<div class="outline-text-2" id="text-org05aa392">
<div class="properties" id="org25be897">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-right">2018</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-right">Xiamen, China</td>
</tr>
</tbody>
</table>

</div>


<p>
This talk was based on
<a href="papers.html#ID-f7400180-00b7-4b54-a902-8941b3bd3823">Stable log surfaces, admissible covers, and canonical curves of genus 4</a>. 
</p>
</div>
</div>

<div id="outline-container-orgc8a883f" class="outline-2">
<h2 id="orgc8a883f">How to count using (co)homology</h2>
<div class="outline-text-2" id="text-orgc8a883f">
<div class="properties" id="orge7ddb4d">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2018</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Mumbai, India</td>
</tr>

<tr>
<td class="org-left"><b>comments</b></td>
<td class="org-left">expository</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="talks/2018-tifr.pdf">notes</a></td>
</tr>

<tr>
<td class="org-left"><b>labels</b></td>
<td class="org-left"><a href="expository.html#ID-05f9493f-833e-4f64-a2b5-321a11c91a3b">expository</a></td>
</tr>
</tbody>
</table>

</div>

<p>
This was an expository talk for undergraduate students.  Through examples, I explained how to use the cup product in cohomology (more precisely, its dual, the intersection product on homology) to solve some counting problems.  This was inspired by a similar talk by Rahul Pandharipande that I heard when I was an undergraduate. 
</p>
</div>

<ul class="org-ul">
<li><a id="orga7e4460"></a>What links here?<br />
<div class="outline-text-3" id="text-orga7e4460">
<ul class="org-ul">
<li><a href="expository.html#ID-05f9493f-833e-4f64-a2b5-321a11c91a3b">Expository writing and talks</a></li>
<li><a href="index.html#ID-d990bcc9-227c-4e82-9e93-512139e14f45">Home</a></li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgcde30bd" class="outline-2">
<h2 id="orgcde30bd">What are ribbons and what do they tell us about Riemann surfaces</h2>
<div class="outline-text-2" id="text-orgcde30bd">
<div class="properties" id="org9adb64a">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-right">2018</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-right">Bengaluru, India</td>
</tr>
</tbody>
</table>

</div>


<p>
This talk was based on
<a href="papers.html#ID-c399a596-99cb-41bc-945b-a2846c40757e">The canonical syzygy conjecture for ribbons</a>.
</p>
</div>
</div>

<div id="outline-container-org0fa3c79" class="outline-2">
<h2 id="org0fa3c79">What are ribbons and what do they tell us about Riemann surfaces</h2>
<div class="outline-text-2" id="text-org0fa3c79">
<div class="properties" id="org7e44390">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2018</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Melbourne, Australia</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="talks/2018-Monash.pdf">notes</a></td>
</tr>
</tbody>
</table>

</div>


<p>
This talk was based on
<a href="papers.html#ID-c399a596-99cb-41bc-945b-a2846c40757e">The canonical syzygy conjecture for ribbons</a>.
</p>
</div>
</div>


<div id="outline-container-orgbe6329c" class="outline-2">
<h2 id="orgbe6329c">On the critical loci of finite maps</h2>
<div class="outline-text-2" id="text-orgbe6329c">
<div class="properties" id="orgd7eb314">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-right">2018</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-right">Canberra, Australia</td>
</tr>
</tbody>
</table>

</div>


<p>
This talk was based on
<a href="papers.html#ID-82e9302f-6674-41b8-97cd-6733ac7edf89">Ramification divisors of general projections</a>.
</p>
</div>
</div>

<div id="outline-container-orgafae9c7" class="outline-2">
<h2 id="orgafae9c7">Quadrature and algebraic geometry</h2>
<div class="outline-text-2" id="text-orgafae9c7">
<div class="properties" id="org57c5691">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2018</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Creswick, Victoria, Australia</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="talks/2018-MATRIX.pdf">notes</a></td>
</tr>
</tbody>
</table>

</div>
</div>
</div>


<div id="outline-container-org64b522d" class="outline-2">
<h2 id="org64b522d">Vector bundles and finite covers</h2>
<div class="outline-text-2" id="text-org64b522d">
<div class="properties" id="orga73b347">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-right">2017</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-right">Chapel Hill, North Carolina</td>
</tr>
</tbody>
</table>

</div>


<p>
This talk was based on
<a href="papers.html#ID-4b773769-0ca6-42a8-a8e6-309dd23ffa5c">Vector bundles and finite covers</a>.
</p>
</div>
</div>

<div id="outline-container-org8044ea3" class="outline-2">
<h2 id="org8044ea3">Vector bundles and finite covers</h2>
<div class="outline-text-2" id="text-org8044ea3">
<div class="properties" id="org77f8ee3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-right">2017</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-right">Athens, Georgia</td>
</tr>
</tbody>
</table>

</div>


<p>
This talk was based on
<a href="papers.html#ID-4b773769-0ca6-42a8-a8e6-309dd23ffa5c">Vector bundles and finite covers</a>.
</p>
</div>
</div>


<div id="outline-container-orga6bc49a" class="outline-2">
<h2 id="orga6bc49a">How to count using topology</h2>
<div class="outline-text-2" id="text-orga6bc49a">
<div class="properties" id="orgc88dc2b">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2017</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Tacoma, WA</td>
</tr>

<tr>
<td class="org-left"><b>comments</b></td>
<td class="org-left">expository</td>
</tr>

<tr>
<td class="org-left"><b>labels</b></td>
<td class="org-left"><a href="expository.html#ID-05f9493f-833e-4f64-a2b5-321a11c91a3b">expository</a></td>
</tr>
</tbody>
</table>

</div>
</div>


<ul class="org-ul">
<li><a id="orgf687648"></a>What links here?<br />
<div class="outline-text-3" id="text-orgf687648">
<ul class="org-ul">
<li><a href="expository.html#ID-05f9493f-833e-4f64-a2b5-321a11c91a3b">Expository writing and talks</a></li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgda3bc2c" class="outline-2">
<h2 id="orgda3bc2c">Quivers and their representations</h2>
<div class="outline-text-2" id="text-orgda3bc2c">
<div class="properties" id="org5b89a7a">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-right">2017</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-right">Pune, India</td>
</tr>
</tbody>
</table>

</div>
</div>
</div>


<div id="outline-container-org5cb738a" class="outline-2">
<h2 id="org5cb738a">Vector bundles and finite covers</h2>
<div class="outline-text-2" id="text-org5cb738a">
<div class="properties" id="orgefae163">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-right">2017</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-right">Atlanta, Georgia</td>
</tr>
</tbody>
</table>

</div>


<p>
This talk was based on
<a href="papers.html#ID-4b773769-0ca6-42a8-a8e6-309dd23ffa5c">Vector bundles and finite covers</a>.
</p>
</div>
</div>
