content/talks.org
*  Geometry of moduli spaces                                           :talk:
:properties:
:venue: Australian National University
:where:    Canberra, Australia
:when:     2016
:type:     colloquium
:ID:       cd1afd98-f8a1-4363-958e-209b815cb316
:end:

* Vector bundles and finite covers                                     :talk:
:properties:
:venue:     Conference on moduli and birational geometry
:where:    Jeju Island, South Korea
:when:     2016
:type:     conference
:links:      [[file:talks/2016-Jeju.pdf][notes]]
:ID:       ae81d0d0-68bd-46c7-97b7-dfe6dc0f563c
:end:

This talk was based on
[[id:4b773769-0ca6-42a8-a8e6-309dd23ffa5c][Vector bundles and finite covers]].


*  Vector bundles and finite covers                                    :talk:
:properties:
:venue: Indian Institute of Science Education and Research
:where:    Pune
:when:     2016
:type:     seminar
:ID:       04d582a4-a321-41ed-8360-dcfb52875ba4
:end:

This talk was based on
[[id:4b773769-0ca6-42a8-a8e6-309dd23ffa5c][Vector bundles and finite covers]].


*  Ribbons and Green's conjecture                                      :talk:
:properties:
:venue: University of South Carolina
:where:    Columbia, South Carolina
:when:     2016
:type:     seminar
:ID:       e6c16ac8-81f6-4f87-84b4-f412bbee780a
:end:

This talk was based on
[[id:c399a596-99cb-41bc-945b-a2846c40757e][The canonical syzygy conjecture for ribbons]].

*  Ribbons and Green's conjecture                                      :talk:
:properties:
:venue: University of Georgia
:where:    Athens, Georgia
:when:     2016
:type:     seminar
:ID:       8876cb8d-37f2-44d1-8450-b03d26e2c702
:end:

This talk was based on
[[id:c399a596-99cb-41bc-945b-a2846c40757e][The canonical syzygy conjecture for ribbons]].


*  Cycles on Hurwitz spaces                                            :talk:
:properties:
:venue:      Workshop on cycles on moduli spaces, geometric invariant theory, and dynamics, Institute for Computational and Experimental Research in Mathematics
:where:    Providence, Rhode Island
:when:     2016
:type:     conference
:ID:       c73f686b-9406-4abb-a84e-7955c51bdfc5
:end:

*  The algebra of canonical curves and the geometry of their moduli space :talk:
:properties:
:venue: University of Georgia
:where:    Athens, Georgia
:when:     2016
:type:     seminar
:ID:       45636776-e24f-4d46-a179-3f8ca045cd6f
:end:

*  Picard groups of Hurwitz spaces                                     :talk:
:properties:
:venue:     Higher genus curves and fibrations of higher genus curves in mathematical physics and arithmetic geometry II, AMS joint mathematics meetings
:where:    Seattle, Washington
:when:     2016
:type:     conference
:ID:       40dfccbc-e498-40e3-81d6-c4af5b77bcfa
:end:

This talk was based on
[[id:e0e0aebf-32c6-4041-95d5-16574e6c0513][The Picard rank conjecture for the Hurwitz spaces of degree up to five]].

*  Limits of plane quintics via covers of stacky curves                :talk:
:properties:
:venue:     Moduli spaces in algebraic geometry I, AMS joint mathematics meetings
:where:    Seattle, Washington
:when:     2016
:type:     conference
:ID:       7e7d2ee1-959c-4458-baf3-1601dfa90284
:end:

This talk was based on
[[id:1d0dda32-8233-4fd8-8303-a6d7e16dc0cc][Covers of stacky curves and limits of plane quintics]].

* Limits of plane quintics via covers of stacky curves                 :talk:
:properties:
:when:     2015
:venue:      Boston College--Northeastern algebraic geometry conference, Northeastern University
:where:    Boston, Massachusetts
:links:      [[file:talks/2015-AGNUBS.pdf][notes]]
:type:     conference
:ID:       21223271-0bdc-4ea4-b4ea-847a80c25d1f
:end:

This talk was based on
[[id:1d0dda32-8233-4fd8-8303-a6d7e16dc0cc][Covers of stacky curves and limits of plane quintics]].


* Limits of plane quintics via covers of stacky curves                 :talk:
:properties:
:when:     2015
:venue:      Summer institute in algebraic geometry, University of Utah
:where:    Salt Lake City, Utah
:links:      [[file:talks/2015-quintics_poster.pdf][poster]]
:type:     poster
:ID:       1e3e4c86-a76c-47a3-8bee-d399fd674094
:end:

This talk was based on
[[id:1d0dda32-8233-4fd8-8303-a6d7e16dc0cc][Covers of stacky curves and limits of plane quintics]].


* Syzygies of canonical curves and the geometry of \(\overline M_g\)   :talk:
:properties:
:when:     2015
:venue:     SIAM applied algebraic geometry conference
:where:    Daejeon, South Korea
:links:      [[file:talks/2015-SIAM.pdf][notes]]
:type:     conference
:ID:       7e9ab8f9-9f54-46e1-9ea3-36d1e74a938b
:end:

This talk was based on
[[id:800287ce-183c-42d7-ad07-0f73202dc7c3][Toward GIT stability of syzygies of canonical curves]].

* GIT stability of syzygies of curves                                  :talk:
:properties:
:when:     2015
:venue: Classical Algebraic Geometry, Mathematisches Forschungsinstitut Oberwolfach
:where:    Oberwolfach, Germany
:comments:  mini talk
:ID:       ab829dfb-bb59-446f-b01c-edeb97ecbc44
:end:
This talk was based on
[[id:800287ce-183c-42d7-ad07-0f73202dc7c3][Toward GIT stability of syzygies of canonical curves]].
