talks.html


<div id="outline-container-org1b9c3c2" class="outline-2">
<h2 id="org1b9c3c2">Geometry of moduli spaces</h2>
<div class="outline-text-2" id="text-org1b9c3c2">
<div class="properties" id="org92a6dfc">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-right">2016</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-right">Canberra, Australia</td>
</tr>
</tbody>
</table>

</div>
</div>
</div>


<div id="outline-container-orgf3317be" class="outline-2">
<h2 id="orgf3317be">Vector bundles and finite covers</h2>
<div class="outline-text-2" id="text-orgf3317be">
<div class="properties" id="org3e8d1d4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2016</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Jeju Island, South Korea</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="talks/2016-Jeju.pdf">notes</a></td>
</tr>
</tbody>
</table>

</div>


<p>
This talk was based on
<a href="papers.html#ID-4b773769-0ca6-42a8-a8e6-309dd23ffa5c">Vector bundles and finite covers</a>.
</p>
</div>
</div>


<div id="outline-container-orge14bdfb" class="outline-2">
<h2 id="orge14bdfb">Vector bundles and finite covers</h2>
<div class="outline-text-2" id="text-orge14bdfb">
<div class="properties" id="org6142ed0">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-right">2016</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-right">Pune</td>
</tr>
</tbody>
</table>

</div>


<p>
This talk was based on
<a href="papers.html#ID-4b773769-0ca6-42a8-a8e6-309dd23ffa5c">Vector bundles and finite covers</a>.
</p>
</div>
</div>


<div id="outline-container-org569a170" class="outline-2">
<h2 id="org569a170">Ribbons and Green&rsquo;s conjecture</h2>
<div class="outline-text-2" id="text-org569a170">
<div class="properties" id="org2f796bd">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-right">2016</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-right">Columbia, South Carolina</td>
</tr>
</tbody>
</table>

</div>


<p>
This talk was based on
<a href="papers.html#ID-c399a596-99cb-41bc-945b-a2846c40757e">The canonical syzygy conjecture for ribbons</a>.
</p>
</div>
</div>

<div id="outline-container-org182a481" class="outline-2">
<h2 id="org182a481">Ribbons and Green&rsquo;s conjecture</h2>
<div class="outline-text-2" id="text-org182a481">
<div class="properties" id="org0084381">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-right">2016</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-right">Athens, Georgia</td>
</tr>
</tbody>
</table>

</div>


<p>
This talk was based on
<a href="papers.html#ID-c399a596-99cb-41bc-945b-a2846c40757e">The canonical syzygy conjecture for ribbons</a>.
</p>
</div>
</div>


<div id="outline-container-org2650397" class="outline-2">
<h2 id="org2650397">Cycles on Hurwitz spaces</h2>
<div class="outline-text-2" id="text-org2650397">
<div class="properties" id="org852a356">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-right">2016</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-right">Providence, Rhode Island</td>
</tr>
</tbody>
</table>

</div>
</div>
</div>


<div id="outline-container-orgcff9c4d" class="outline-2">
<h2 id="orgcff9c4d">The algebra of canonical curves and the geometry of their moduli space</h2>
<div class="outline-text-2" id="text-orgcff9c4d">
<div class="properties" id="orgf9a0238">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-right">2016</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-right">Athens, Georgia</td>
</tr>
</tbody>
</table>

</div>
</div>
</div>


<div id="outline-container-org15449d0" class="outline-2">
<h2 id="org15449d0">Picard groups of Hurwitz spaces</h2>
<div class="outline-text-2" id="text-org15449d0">
<div class="properties" id="org60b8fb4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-right">2016</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-right">Seattle, Washington</td>
</tr>
</tbody>
</table>

</div>


<p>
This talk was based on
<a href="papers.html#ID-e0e0aebf-32c6-4041-95d5-16574e6c0513">The Picard rank conjecture for the Hurwitz spaces of degree up to five</a>.
</p>
</div>
</div>

<div id="outline-container-orgefc4e99" class="outline-2">
<h2 id="orgefc4e99">Limits of plane quintics via covers of stacky curves</h2>
<div class="outline-text-2" id="text-orgefc4e99">
<div class="properties" id="org8c7d6f5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-right">2016</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-right">Seattle, Washington</td>
</tr>
</tbody>
</table>

</div>


<p>
This talk was based on
<a href="papers.html#ID-1d0dda32-8233-4fd8-8303-a6d7e16dc0cc">Covers of stacky curves and limits of plane quintics</a>.
</p>
</div>
</div>

<div id="outline-container-org5beef73" class="outline-2">
<h2 id="org5beef73">Limits of plane quintics via covers of stacky curves</h2>
<div class="outline-text-2" id="text-org5beef73">
<div class="properties" id="org9a89f44">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2015</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Boston, Massachusetts</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="talks/2015-AGNUBS.pdf">notes</a></td>
</tr>
</tbody>
</table>

</div>


<p>
This talk was based on
<a href="papers.html#ID-1d0dda32-8233-4fd8-8303-a6d7e16dc0cc">Covers of stacky curves and limits of plane quintics</a>.
</p>
</div>
</div>


<div id="outline-container-orgcd99c0e" class="outline-2">
<h2 id="orgcd99c0e">Limits of plane quintics via covers of stacky curves</h2>
<div class="outline-text-2" id="text-orgcd99c0e">
<div class="properties" id="orgbfcde6b">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2015</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Salt Lake City, Utah</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="talks/2015-quintics_poster.pdf">poster</a></td>
</tr>
</tbody>
</table>

</div>


<p>
This talk was based on
<a href="papers.html#ID-1d0dda32-8233-4fd8-8303-a6d7e16dc0cc">Covers of stacky curves and limits of plane quintics</a>.
</p>
</div>
</div>


<div id="outline-container-orga0c1d13" class="outline-2">
<h2 id="orga0c1d13">Syzygies of canonical curves and the geometry of \(\overline M_g\)</h2>
<div class="outline-text-2" id="text-orga0c1d13">
<div class="properties" id="orgcefa286">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2015</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Daejeon, South Korea</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="talks/2015-SIAM.pdf">notes</a></td>
</tr>
</tbody>
</table>

</div>


<p>
This talk was based on
<a href="papers.html#ID-800287ce-183c-42d7-ad07-0f73202dc7c3">Toward GIT stability of syzygies of canonical curves</a>.
</p>
</div>
</div>

<div id="outline-container-orga47627d" class="outline-2">
<h2 id="orga47627d">GIT stability of syzygies of curves</h2>
<div class="outline-text-2" id="text-orga47627d">
<div class="properties" id="org1b7ba1c">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2015</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Oberwolfach, Germany</td>
</tr>

<tr>
<td class="org-left"><b>comments</b></td>
<td class="org-left">mini talk</td>
</tr>
</tbody>
</table>

</div>

<p>
This talk was based on
<a href="papers.html#ID-800287ce-183c-42d7-ad07-0f73202dc7c3">Toward GIT stability of syzygies of canonical curves</a>.
</p>
</div>
</div>
