content/talks.org
* Syzygies, GIT, and the moduli space of curves                        :talk:
:properties:
:when:     2015
:venue: Purdue University
:where:    West Lafayette, Indiana
:type:     seminar
:ID:       7348528b-793f-4d36-b2ed-ab8efd77ad4a
:end:
This talk was based on
[[id:800287ce-183c-42d7-ad07-0f73202dc7c3][Toward GIT stability of syzygies of canonical curves]].
* Limits of plane curves via stacky branched covers                    :talk:
:properties:
:when:     2015
:venue: Ohio State University
:where:    Columbus, Ohio
:type:     seminar
:ID:       739db4da-7186-418f-964b-8aa7e0e4703b
:end:
This talk was based on
[[id:1d0dda32-8233-4fd8-8303-a6d7e16dc0cc][Covers of stacky curves and limits of plane quintics]].
* Syzygies, GIT, and the log minimal model program for \(\overline{M}_g\) :talk:
:properties:
:when:     2015
:venue: Harvard University
:where:    Cambridge, Massachusetts
:type:     seminar
:ID:       3df5501f-d7ec-4283-b56a-d6073bc05417
:end:
This talk was based on
[[id:800287ce-183c-42d7-ad07-0f73202dc7c3][Toward GIT stability of syzygies of canonical curves]].
* Picard groups of Hurwitz spaces                                      :talk:
:properties:
:when:     2015
:venue: Courant Institute, New York University
:where:    New York City, New York
:type:     seminar
:ID:       0b880ed0-0f3d-4687-9fb0-21d3c8bccf61
:end:
This talk was based on
[[id:e0e0aebf-32c6-4041-95d5-16574e6c0513][The Picard rank conjecture for the Hurwitz spaces of degree up to five]].
* The birational geometry of \(\overline M_g\)                         :talk:
:properties:
:when:     2015
:venue: Indian Institute for Science Research and Education
:where:    Pune, India
:type:     seminar
:ID:       2f8a5cd4-d89d-438e-97e1-f94b42d8b643
:end:
* Syzygies of canonical curves and birational geometry of \(\overline M_g\) :talk:
:properties:
:when:     2015
:venue: Stony Brook University
:where:    Stony Brook, New York
:type:     seminar
:ID:       e1162586-0dee-4f0e-8207-bff27c0c15fb
:end:
This talk was based on
[[id:800287ce-183c-42d7-ad07-0f73202dc7c3][Toward GIT stability of syzygies of canonical curves]].
* GIT stability of syzygies of canonical curves                        :talk:
:properties:
:when:     2014
:venue: University of Michigan
:where:    Ann Arbor, Michigan
:type:     seminar
:ID:       bba4d3ba-4a2e-4632-ad98-e70ffb3d2126
:end:
This talk was based on
[[id:800287ce-183c-42d7-ad07-0f73202dc7c3][Toward GIT stability of syzygies of canonical curves]].
* GIT stability of syzygies of canonical curves                        :talk:
:properties:
:when:     2014
:venue: Yale University
:where:    New Haven, Connecticut
:type:     seminar
:ID:       05ed8100-61da-4ea8-8ca6-887315a43029
:end:
This talk was based on
[[id:800287ce-183c-42d7-ad07-0f73202dc7c3][Toward GIT stability of syzygies of canonical curves]].
* Towards GIT stability of syzygies of canonical curves                :talk:
:properties:
:when:     2014
:venue: Boston College
:where:    Boston, Massachusetts
:type:     seminar
:ID:       b6f86fca-de6f-4d34-9ba5-81ec451affcb
:end:
This talk was based on
[[id:800287ce-183c-42d7-ad07-0f73202dc7c3][Toward GIT stability of syzygies of canonical curves]].
* Towards GIT stability of syzygies of canonical curves                :talk:
:properties:
:when:     2013
:meeting:  Conference on moduli and birational geometry
:venue: Postech
:where:    Pohang, Korea
:links:      [[file:talks/2013-syz.pdf][notes]]
:type:     conference
:ID:       ffe31f04-6a99-4bf0-af76-adfcc1bff1e8
:end:
This talk was based on
[[id:800287ce-183c-42d7-ad07-0f73202dc7c3][Toward GIT stability of syzygies of canonical curves]].
* Towards GIT stability of syzygies of canonical curves                :talk:
:properties:
:when:     2013
:venue:     Geometry of algebraic varieties, AMS sectional meeting
:where:    Philadelphia, Pennsylvania
:type:     seminar
:ID:       547bd25b-0828-442e-8a99-e9927fe0f3cd
:end:
This talk was based on
[[id:800287ce-183c-42d7-ad07-0f73202dc7c3][Toward GIT stability of syzygies of canonical curves]].
* Sharp slope bounds for sweeping families of trigonal curves          :talk:
:properties:
:when:     2013
:venue:      Algebraic geometry northeastern series, Boston College
:where:    Boston, Massachusetts
:links:      [[file:talks/2013-slopes_poster.pdf][poster]]
:type:     poster
:ID:       d745108a-e515-4fd9-9c3a-69a3e5e08dac
:end:
This talk was based on
[[id:75d3ebc0-1174-40e1-9ec5-a949bad877de][Sharp slope bounds for sweeping families of trigonal curves]].
* Alternate compactifications of Hurwitz spaces                        :talk:
:properties:
:when:     2013
:venue: Stanford University
:where:    Palo Alto, California
:type:     seminar
:links:      [[file:talks/2013-Hdg.pdf][notes]]
:ID:       9745e31a-f267-419d-80f8-879bf8e7a0fa
:end:
This talk was based on
[[id:5da2ae43-0723-4518-87a0-08743399185a][Alternate compactifications of Hurwitz spaces]].
