talks.html
<div id="outline-container-orgcb43a23" class="outline-2">
<h2 id="orgcb43a23">Syzygies, GIT, and the moduli space of curves</h2>
<div class="outline-text-2" id="text-orgcb43a23">
<div class="properties" id="org4bb25e8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-right">2015</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-right">West Lafayette, Indiana</td>
</tr>
</tbody>
</table>

</div>

<p>
This talk was based on
<a href="papers.html#ID-800287ce-183c-42d7-ad07-0f73202dc7c3">Toward GIT stability of syzygies of canonical curves</a>.
</p>
</div>
</div>
<div id="outline-container-org849c118" class="outline-2">
<h2 id="org849c118">Limits of plane curves via stacky branched covers</h2>
<div class="outline-text-2" id="text-org849c118">
<div class="properties" id="org9e9c772">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-right">2015</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-right">Columbus, Ohio</td>
</tr>
</tbody>
</table>

</div>

<p>
This talk was based on
<a href="papers.html#ID-1d0dda32-8233-4fd8-8303-a6d7e16dc0cc">Covers of stacky curves and limits of plane quintics</a>.
</p>
</div>
</div>
<div id="outline-container-org5a815cc" class="outline-2">
<h2 id="org5a815cc">Syzygies, GIT, and the log minimal model program for \(\overline{M}_g\)</h2>
<div class="outline-text-2" id="text-org5a815cc">
<div class="properties" id="org716fce3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-right">2015</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-right">Cambridge, Massachusetts</td>
</tr>
</tbody>
</table>

</div>

<p>
This talk was based on
<a href="papers.html#ID-800287ce-183c-42d7-ad07-0f73202dc7c3">Toward GIT stability of syzygies of canonical curves</a>.
</p>
</div>
</div>
<div id="outline-container-org15980f3" class="outline-2">
<h2 id="org15980f3">Picard groups of Hurwitz spaces</h2>
<div class="outline-text-2" id="text-org15980f3">
<div class="properties" id="org6da3e96">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-right">2015</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-right">New York City, New York</td>
</tr>
</tbody>
</table>

</div>

<p>
This talk was based on
<a href="papers.html#ID-e0e0aebf-32c6-4041-95d5-16574e6c0513">The Picard rank conjecture for the Hurwitz spaces of degree up to five</a>.
</p>
</div>
</div>
<div id="outline-container-orgaf32ece" class="outline-2">
<h2 id="orgaf32ece">The birational geometry of \(\overline M_g\)</h2>
<div class="outline-text-2" id="text-orgaf32ece">
<div class="properties" id="orga10f311">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-right">2015</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-right">Pune, India</td>
</tr>
</tbody>
</table>

</div>
</div>
</div>

<div id="outline-container-org16eb332" class="outline-2">
<h2 id="org16eb332">Syzygies of canonical curves and birational geometry of \(\overline M_g\)</h2>
<div class="outline-text-2" id="text-org16eb332">
<div class="properties" id="org46733fe">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-right">2015</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-right">Stony Brook, New York</td>
</tr>
</tbody>
</table>

</div>

<p>
This talk was based on
<a href="papers.html#ID-800287ce-183c-42d7-ad07-0f73202dc7c3">Toward GIT stability of syzygies of canonical curves</a>.
</p>
</div>
</div>
<div id="outline-container-org434d53e" class="outline-2">
<h2 id="org434d53e">GIT stability of syzygies of canonical curves</h2>
<div class="outline-text-2" id="text-org434d53e">
<div class="properties" id="orged6875f">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-right">2014</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-right">Ann Arbor, Michigan</td>
</tr>
</tbody>
</table>

</div>

<p>
This talk was based on
<a href="papers.html#ID-800287ce-183c-42d7-ad07-0f73202dc7c3">Toward GIT stability of syzygies of canonical curves</a>.
</p>
</div>
</div>
<div id="outline-container-org5e10c02" class="outline-2">
<h2 id="org5e10c02">GIT stability of syzygies of canonical curves</h2>
<div class="outline-text-2" id="text-org5e10c02">
<div class="properties" id="org4514756">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-right">2014</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-right">New Haven, Connecticut</td>
</tr>
</tbody>
</table>

</div>

<p>
This talk was based on
<a href="papers.html#ID-800287ce-183c-42d7-ad07-0f73202dc7c3">Toward GIT stability of syzygies of canonical curves</a>.
</p>
</div>
</div>
<div id="outline-container-orgb7589b5" class="outline-2">
<h2 id="orgb7589b5">Towards GIT stability of syzygies of canonical curves</h2>
<div class="outline-text-2" id="text-orgb7589b5">
<div class="properties" id="orgb0a172b">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-right">2014</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-right">Boston, Massachusetts</td>
</tr>
</tbody>
</table>

</div>

<p>
This talk was based on
<a href="papers.html#ID-800287ce-183c-42d7-ad07-0f73202dc7c3">Toward GIT stability of syzygies of canonical curves</a>.
</p>
</div>
</div>
<div id="outline-container-orged30768" class="outline-2">
<h2 id="orged30768">Towards GIT stability of syzygies of canonical curves</h2>
<div class="outline-text-2" id="text-orged30768">
<div class="properties" id="org86e3c9e">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2013</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Pohang, Korea</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="talks/2013-syz.pdf">notes</a></td>
</tr>
</tbody>
</table>

</div>

<p>
This talk was based on
<a href="papers.html#ID-800287ce-183c-42d7-ad07-0f73202dc7c3">Toward GIT stability of syzygies of canonical curves</a>.
</p>
</div>
</div>
<div id="outline-container-orge839319" class="outline-2">
<h2 id="orge839319">Towards GIT stability of syzygies of canonical curves</h2>
<div class="outline-text-2" id="text-orge839319">
<div class="properties" id="org9b255ec">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-right">2013</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-right">Philadelphia, Pennsylvania</td>
</tr>
</tbody>
</table>

</div>

<p>
This talk was based on
<a href="papers.html#ID-800287ce-183c-42d7-ad07-0f73202dc7c3">Toward GIT stability of syzygies of canonical curves</a>.
</p>
</div>
</div>
<div id="outline-container-orgdc2e774" class="outline-2">
<h2 id="orgdc2e774">Sharp slope bounds for sweeping families of trigonal curves</h2>
<div class="outline-text-2" id="text-orgdc2e774">
<div class="properties" id="orga72db5b">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2013</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Boston, Massachusetts</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="talks/2013-slopes_poster.pdf">poster</a></td>
</tr>
</tbody>
</table>

</div>

<p>
This talk was based on
<a href="papers.html#ID-75d3ebc0-1174-40e1-9ec5-a949bad877de">Sharp slope bounds for sweeping families of trigonal curves</a>.
</p>
</div>
</div>
<div id="outline-container-org857e505" class="outline-2">
<h2 id="org857e505">Alternate compactifications of Hurwitz spaces</h2>
<div class="outline-text-2" id="text-org857e505">
<div class="properties" id="org7cda8da">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2013</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Palo Alto, California</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="talks/2013-Hdg.pdf">notes</a></td>
</tr>
</tbody>
</table>

</div>

<p>
This talk was based on
<a href="papers.html#ID-5da2ae43-0723-4518-87a0-08743399185a">Alternate compactifications of Hurwitz spaces</a>.
</p>
</div>
</div>
